Revit 2026 API

# DuctSizes Class

---

Class RbsDuctSizes being used to store the duct sizes

SystemObject Autodesk.Revit.DB.MechanicalDuctSizes

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctSizes : IEnumerable<MEPSize>,
	IDisposable
```
```vb
Public Class DuctSizes
	Implements IEnumerable(Of MEPSize), IDisposable
```
```cpp
public ref class DuctSizes : IEnumerable<MEPSize^>,
	IDisposable
```
```fsharp
type DuctSizes =
    class
        interface IEnumerable<MEPSize>
        interface IDisposable
    end
```

The DuctSizes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Checks whether a duct size with the nominal diameter exists. |
|  | Dispose | Releases all resources used by the DuctSizes |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetDuctSizeIterator | Returns a DuctSizeIterator that iterates through the collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace